---
kind: property
id: P:Autodesk.Revit.DB.CurtainGrid.NumULines
source: html/7b186b2e-ccbf-bd63-175a-0cd599598ba4.htm
---
# Autodesk.Revit.DB.CurtainGrid.NumULines Property

Get the number of grid lines in the U direction.

## Syntax (C#)
```csharp
public int NumULines { get; }
```